  кому  Все
*1. Напишите программу, которая на вход принимает два числа и проверяет, является ли первое число квадратом второго.

a = 25; b = 5 -> да
a = 2 b = 10 -> нет
a = 9; b = -3 -> да
a = -3 b = 9 -> нет*/

Console.Write("Введите первое число: ");
int first = int.Parse(Console.ReadLine()!);
Console.Write("Введите второе число: ");
int second = int.Parse(Console.ReadLine()!);
if (first == Convert.ToInt32(Math.Pow(second, 2)))
{
    Console.WriteLine("Да");
}
else Console.WriteLine("Нет");

Софья Главацкая  кому  Все 20:49
Напишите программу, которая будет выдавать название дня недели по заданному номеру.

3 -> Среда
5 ->  Пятница

Софья Главацкая  кому  Все 20:56
И - && (оба верные все работает)
ИЛИ - || (или один или оба верно, остальное ложь)

АНДРЕЙ  кому  Все 20:56
& такие?

Вы  кому  Все 20:59
Console.Write("Введите число: ");
int number = int.Parse(Console.ReadLine()!);
if(number == 1) Console.WriteLine("Понедельник");
if(number == 2) Console.WriteLine("Вторник");
if(number == 3) Console.WriteLine("Среда");
if(number == 4) Console.WriteLine("Четверг");
if(number == 5) Console.WriteLine("Пятница");
if(number == 6) Console.WriteLine("Суббота");
if(number == 7) Console.WriteLine("Воскресенье");
else if(number<1 || number>7) Console.WriteLine("Введен неверный день недели ");

Игорь  кому  Все 21:00
вопрос общий по C#. это язык который наиболее используется в блокчейн разработке?

Софья Главацкая  кому  Все 21:01
. Напишите программу, которая на вход принимает одно число (N), а на выходе показывает все целые числа в промежутке от -N до N.

4 -> "-4, -3, -2, -1, 0, 1, 2, 3, 4"
2 -> " -2, -1, 0, 1, 2"

Владислав Липкин  кому  Все 21:09
/*. Напишите программу, которая на вход принимает одно число (N), а на выходе показывает все целые числа в промежутке от -N до N.

4 -> "-4, -3, -2, -1, 0, 1, 2, 3, 4"
2 -> " -2, -1, 0, 1, 2"*/


Console.WriteLine("Введите число: ");
int number = int.Parse(Console.ReadLine());

int num2 = - number;

while (num2 <= number) {
    Console.Write($"{num2} ");
    num2++;
}

Софья Главацкая 21:15
// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает **последнюю** цифру этого числа.
    
//     456 -> 6
    
//     782 -> 2
    
//     918 -> 8

Console.Write("Введите трехзначное число: ");
int number = int.Parse(Console.ReadLine()!);

// % - деление с остатком 456%100 = 45.6 -> 6
// / - целочисленное деление 456/10 = 45.6 -> 45

int num = number%10;

Console.WriteLine($"Последняя цифра числа {number} равна {num}");
проверка на четность
a % 2 = 0 - чет
a % 2 != 0 - нечет